<details><summary>Digger run report at 2024-08-05 06:59:23 (UTC)</summary>
    <details><summary>Plan for <b>anzeha/floorball-fantasy-infra#staging_kubernetes-addons</b></summary>
  
```terraform
Terraform will perform the following actions:

  # kubernetes_namespace.example will be created
  + resource "kubernetes_namespace" "example" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + annotations      = {
              + "name" = "example-annotation"
            }
          + generation       = (known after apply)
          + labels           = {
              + "mylabel" = "label-value"
            }
          + name             = "terraform-example-namespace"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.nginx-controller[0].helm_release.application will be created
  + resource "helm_release" "application" {
      + atomic                     = false
      + chart                      = "ingress-nginx"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "ingress-nginx"
      + namespace                  = "kube-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://kubernetes.github.io/ingress-nginx"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + null,
        ]
      + verify                     = false
      + version                    = "4.5.2"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "controller.daemonset.useHostPort"
          + value = "false"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "controller.ingressClassResource.default"
          + value = "true"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "controller.ingressClassResource.name"
          + value = "nginx"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "controller.kind"
          + value = "DaemonSet"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "controller.publishService.enabled"
          + value = "true"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "controller.resources.requests.memory"
          + type  = "string"
          + value = "140Mi"
        }
      + set {
          + name  = "controller.service.externalTrafficPolicy"
          + value = "Local"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "controller.service.loadBalancerIP"
          + value = "34.90.224.248"
            # (1 unchanged attribute hidden)
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Invalid attribute in provider configuration

  with provider["registry.terraform.io/hashicorp/kubernetes"],
  on kubernetes-provider.tf line 2, in provider "kubernetes":
   2: provider "kubernetes" {

'cluster_ca_certificate' is not a valid PEM encoded certificate

  ```
</details>

<details><summary>Terraform plan validation check (staging_kubernetes-addons)</summary>
  Terraform plan validation checks succeeded :white_check_mark:
</details>

</details>